# summary
- pandas
    - 데이터 분석 : 데이터 전처리 파트
    - 테이블 형태의 데이터를 처리하때 사용하는 python 라이브러리
    - Series, DataFrame
    - Series
        - 생성방법, 선택, 수정 방법
    - DataFrame
        - 생성 방법 1 : 딕셔너리의 리스트 : 리스트 -> 컬럼
        - 생성 방법 2 : 리스트의 딕셔너리 : 딕셔너리 -> 로우 데이터
        - row 선택 : 'df.loc[idx]'
        - column 선택 : 'df[column name]'
        - row, column 선택 : 'df.loc[idx, column]'
        - 함수
            - apply, append, concat
            - groupby, merge

In [1]:
import makedata

In [23]:
makedata.get_age(), makedata.get_name()

(25, 'Arnold')

In [37]:
makedata.make_data()

[{'Age': 23, 'Name': 'Billy'},
 {'Age': 40, 'Name': 'Andrew'},
 {'Age': 25, 'Name': 'Jin'},
 {'Age': 37, 'Name': 'Alan'},
 {'Age': 37, 'Name': 'Alvin'},
 {'Age': 35, 'Name': 'Alan'},
 {'Age': 22, 'Name': 'Anthony'},
 {'Age': 40, 'Name': 'Billy'},
 {'Age': 37, 'Name': 'Alvin'},
 {'Age': 38, 'Name': 'Arnold'}]

In [ ]:
# quiz
- makedata 모듈을 이용해서 데이터 프레임 만들기
- user_df 
    - 8명의 데이터가 있는 데이터 프레임을 만드세요
    - UserID
    - Name : makedata.get_name()
    - Age : makedata.get_age()
    - 중복되는 Name 값이 없도록

In [41]:
# 딕셔너리의 리스트 : UserID, Name, Age
datas = {}
datas["UserID"] = list(range(1, 9))
datas["Age"] = [makedata.get_age() for _ in range(8)]
names = []
while True:
    name = makedata.get_name()
    
    if name not in names:
        names.append(name)
    if len(names) >= 8:
        break

        datas["Name"] = names
        
user_df = pd.DataFrame(datas)
user_df

   UserID  Age
0       1   27
1       2   30
2       3   37
3       4   27
4       5   37
5       6   23
6       7   25
7       8   37

In [45]:
# 리스트의 딕셔너리 : UserID, Name, Age
user_df = pd.DataFrame(columns=["UserID", "Name", "Age"])

for idx in range(1, 9):
    name = makedata.get_name()
    while name in list(user_df["Name"]):
        name = makedata.get_name()
    data = {"Name":name, "UserID":idx, "Age":makedata.get_age()}
    user_df.loc[len(user_df)] = data

#user_df = pdDataFrame(datas)
user_df

  UserID     Name Age
0      1   Anchal  22
1      2   Andrew  29
2      3   Arnold  26
3      4     Adam  35
4      5  Anthony  30
5      6     Alex  23
6      7      Jin  28
7      8     Alan  26

In [ ]:
# quiz
- money_df 만들기
    - 15개의 데이터
    - ID : 1 ~ 8 랜덤한 숫자 데이터
        - Money : 1000원 단위로 1000원 ~ 20000원까지의 숫자가 저장

In [61]:
# 딕셔너리 데이터를 데이터 프레임에 하나씩 추가하기
money_df = pd.DataFrame(columns=["ID", "Money"])
#np.random.randint(1, 9)
for _ in range(15):
    money_df.loc[len(money_df)] = {
        "ID":np.random.randint(1, 9),
        "Money":np.random.randint(1, 21)*1000
    }

# 컬럼데이터에서 Unique 값 확인
ids = money_df["ID"].unique()
ids.sort()
ids

array([1, 2, 3, 4, 6, 7, 8], dtype=object)

In [64]:
money_df

   ID  Money
0   3  20000
1   8   9000
2   4  15000
3   4  15000
4   7  17000
5   1   2000
6   2   1000
7   2  10000
8   6  12000
9   7  17000
10  8  19000
11  3  20000
12  7  14000
13  7   1000
14  7   2000

In [65]:
user_df

  UserID     Name Age
0      1   Anchal  22
1      2   Andrew  29
2      3   Arnold  26
3      4     Adam  35
4      5  Anthony  30
5      6     Alex  23
6      7      Jin  28
7      8     Alan  26

In [ ]:
# merge

In [78]:
user_df.merge(money_df, left_on="UserID", right_on="ID")

   UserID    Name Age ID  Money
0       1  Anchal  22  1   2000
1       2  Andrew  29  2   1000
2       2  Andrew  29  2  10000
3       3  Arnold  26  3  20000
4       3  Arnold  26  3  20000
5       4    Adam  35  4  15000
6       4    Adam  35  4  15000
7       6    Alex  23  6  12000
8       7     Jin  28  7  17000
9       7     Jin  28  7  17000
10      7     Jin  28  7  14000
11      7     Jin  28  7   1000
12      7     Jin  28  7   2000
13      8    Alan  26  8   9000
14      8    Alan  26  8  19000

In [82]:
# 컬럼명 변경
user_df.rename(columns={"UserID":"ID"}, inplace=True)
user_df.tail(1)

  ID  Name Age
7  8  Alan  26

In [85]:
user_df.merge(money_df).tail(2)

   ID  Name Age  Money
13  8  Alan  26   9000
14  8  Alan  26  19000

In [84]:
result_df = pd.merge(money_df, user_df)
result_df.tail(2)

   ID  Money    Name Age
13  2  10000  Andrew  29
14  6  12000    Alex  23

In [93]:
# groupby : sum, size, min .. 함수
money_list = result_df.groupby("Name").sum()["Money"].reset_index()
money_list

     Name  Money
0    Adam  30000
1    Alan  28000
2    Alex  12000
3  Anchal   2000
4  Andrew  11000
5  Arnold  40000
6     Jin  51000

In [94]:
# groupby : agg("sum"), agg("mean").. : DataFrame
money_list = result_df.groupby("Name").agg("sum").reset_index()[["Name", "Money"]]
money_list

     Name  Money
0    Adam  30000
1    Alan  28000
2    Alex  12000
3  Anchal   2000
4  Andrew  11000
5  Arnold  40000
6     Jin  51000

In [ ]:
# merge : money_list, user_df : outer

In [95]:
result = pd.merge(user_df, money_list, how="outer")
result

  ID     Name Age    Money
0  1   Anchal  22   2000.0
1  2   Andrew  29  11000.0
2  3   Arnold  26  40000.0
3  4     Adam  35  30000.0
4  5  Anthony  30      NaN
5  6     Alex  23  12000.0
6  7      Jin  28  51000.0
7  8     Alan  26  28000.0

In [ ]:
# fillna : NaN을 특정 데이터로 채워줌

In [97]:
result.fillna(value=0, inplace=True)
result

   ID     Name  Age    Money
0   1   Anchal   22   2000.0
1   2   Andrew   29  11000.0
2   3   Arnold   26  40000.0
3   4     Adam   35  30000.0
4   5  Anthony   30      0.0
5   6     Alex   23  12000.0
6   7      Jin   28  51000.0
7   8     Alan   26  28000.0

In [98]:
# money 컬럼을 정수로 데이터 타입을 변걍
result.dtypes

ID         int64
Name      object
Age        int64
Money    float64
dtype: object

In [101]:
result["Money"] =  result["Money"].astype("int")
result

   ID     Name  Age  Money
0   1   Anchal   22   2000
1   2   Andrew   29  11000
2   3   Arnold   26  40000
3   4     Adam   35  30000
4   5  Anthony   30      0
5   6     Alex   23  12000
6   7      Jin   28  51000
7   8     Alan   26  28000

In [102]:
result.sort_values("Money", ascending=False)

   ID     Name  Age  Money
6   7      Jin   28  51000
2   3   Arnold   26  40000
3   4     Adam   35  30000
7   8     Alan   26  28000
5   6     Alex   23  12000
1   2   Andrew   29  11000
0   1   Anchal   22   2000
4   5  Anthony   30      0

In [103]:
result[:3]

   ID    Name  Age  Money
0   1  Anchal   22   2000
1   2  Andrew   29  11000
2   3  Arnold   26  40000

In [104]:
np.average(result.sort_values("Money", ascending=False)[:3]["Age"])

29.666666666666668